tap "homebrew/bundle"
tap "homebrew/services"

brew "bun", cask: "oven-sh/bun"
brew "sqlite"
brew "gh"
brew "act"
brew "xz"
brew "webp"
brew "jpeg-xl"
brew "automake"
brew "htop"
brew "btop"
brew "cmake"
brew "libtool"
brew "dua-cli"
brew "ffmpeg"
brew "git"
brew "jq"
brew "fx"
brew "postgresql@16", restart_service: true
brew "redis", restart_service: true
brew "the_silver_searcher"
brew "tig"
brew "yt-dlp"
brew "nvm"
brew "starship"
brew "tailscale" # cli
brew "gnupg"
brew "awscli"
brew "mas"
# Quick Look Plugins
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlprettypatch"
cask "quicklook-csv"
cask "betterzip"
cask "webpquicklook"
cask "suspicious-package"
cask "figma-agent"
# Apps
cask "1password"
cask "1password-cli"
cask "arc"
cask "cursor"
cask "docker"
cask "coscreen"
cask "claude"
cask "chatgpt"
cask "chromium"
cask "iterm2"
cask "macwhisper"
cask "psst"
cask "signal"
cask "telegram-desktop"
cask "visual-studio-code"
cask "zoom"
cask "superhuman"
cask "microsoft-remote-desktop"
cask "doppler"
cask "lm-studio"
cask "rectangle"
# Fonts
cask "font-fira-code-nerd-font"
